def area(a, b): 
    """
    Функция вычисляет площадь квадрата.
    Параметры:
        a (int/float): сторона 1
        b (int/float): сторона 2
    Возвращаемое значение:
        int/float a * b - площадь квадрата.
    Пример вызова:
        area(6, 4)  #Вывод: 24.0
    """
    return a * b 

def perimeter(a, b): 
    """
    Функция вычисляет периметр квадрата.
    Параметры:
        a (int/float): сторона 1
        b (int/float): сторона 2
    Возвращаемое значение:
        int/float (a + b) * 2- периметр квадрата.
    Пример вызова:
        perimeter(3, 4)  #Вывод: 14
    """ 
    return (a + b) * 2
