def area(a, h): 
    """
    Функция вычисляет площадь треугольника.
    Параметры:
        a (int/float): основание
        h (int/float): высота
    Возвращаемое значение:
        int/float a * h / 2 - площадь треугольника.
    Пример вызова:
        area(6, 4)  #Вывод: 12.0
    """
    return a * h / 2 

def perimeter(a, b, c):
    """
    Функция вычисляет периметр треугольника.
    Параметры:
        a (int/float): сторона 1
        b (int/float): сторона 2
        c (int/float): сторона 3
    Возвращаемое значение:
        int/float a + b + c - периметр треугольника.
    Пример вызова:
        perimeter(3, 4, 5)  #Вывод: 12
    """ 
    return a + b + c 
